Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Catalogs/УБТ_БотыTelegram/УБТ_БотыTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБТ_БотыTelegram</name>
  <attributes>
    <name>ВариантВзаимодействия</name>
    <type>
      <types>EnumRef.УБТ_ВариантыВзаимодействияСБотамиTelegram</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательРегламентногоЗадания</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВебхука</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекретВебхука</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Enums/УБТ_ВариантыВзаимодействияСБотамиTelegram/УБТ_ВариантыВзаимодействияСБотамиTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБТ_ВариантыВзаимодействияСБотамиTelegram</name>
  <enumValues>
    <name>Вебхук</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗадание</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Catalogs/УБТ_БотыTelegram/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает GUID бота с префиксом расширения. Используется для совместимости с конфигурациями и платформами нижних версий.
// 
// Параметры:
//  Бот - СправочникСсылка.УБТ_БотыTelegram - Бот
// 
// Возвращаемое значение:
//  Строка - Идентификатор элемента бота с префиксом
Функция ИдентификаторЭлементаБотаСПрефиксом(Бот) Экспорт

	Возврат "УБТ_Бот_" + Строка(Бот.УникальныйИдентификатор());

КонецФункции

// Возвращает бота Telegram по имени.
// 
// Параметры:
//  ИмяБота - Строка - Имя бота
// 
// Возвращаемое значение:
//  СправочникСсылка.УБТ_БотыTelegram - Бот Telegram
Функция НайтиБотаTelegramПоИмени(ИмяБота) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	УБТ_БотыTelegram.Ссылка КАК Бот
						  |ИЗ
						  |	Справочник.УБТ_БотыTelegram КАК УБТ_БотыTelegram
						  |ГДЕ
						  |	УБТ_БотыTelegram.Код = &ИмяБота
						  |	И НЕ УБТ_БотыTelegram.ПометкаУдаления");
	Запрос.УстановитьПараметр("ИмяБота", ИмяБота);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Бот;
	КонецЕсли;

	Возврат ПустаяСсылка();

КонецФункции

// Возвращает бота Telegram по секретному заголовку.
// 
// Параметры:
//  СекретВебхука - Строка - Секрет бота
// 
// Возвращаемое значение:
//  СправочникСсылка.УБТ_БотыTelegram - Бот Telegram
Функция НайтиБотаTelegramПоСекретномуЗаголовку(СекретВебхука) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	УБТ_БотыTelegram.Ссылка КАК Бот
						  |ИЗ
						  |	Справочник.УБТ_БотыTelegram КАК УБТ_БотыTelegram
						  |ГДЕ
						  |	УБТ_БотыTelegram.ВариантВзаимодействия = ЗНАЧЕНИЕ(Перечисление.УБТ_ВариантыВзаимодействияСБотамиTelegram.Вебхук)
						  |	И УБТ_БотыTelegram.СекретВебхука = &СекретВебхука
						  |	И НЕ УБТ_БотыTelegram.ПометкаУдаления");
	Запрос.УстановитьПараметр("СекретВебхука", СекретВебхука);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Бот;
	КонецЕсли;

	Возврат ПустаяСсылка();

КонецФункции

#КонецОбласти

#КонецЕсли
